DataProcessors/Лео_ЗагрузкаДоговорыТчУслугиРетро/Лео_ЗагрузкаДоговорыТчУслугиРетро.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Лео_ЗагрузкаДоговорыТчУслугиРетро</name>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФильтрРасширенияФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

Enums/абс_ПериодичностьНачисленияПремийКонтрагентов/абс_ПериодичностьНачисленияПремийКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ПериодичностьНачисленияПремийКонтрагентов</name>
  <enumValues>
    <name>РазовоеНачисление</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_БазаНачисленияУслугКонтрагента/абс_БазаНачисленияУслугКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_БазаНачисленияУслугКонтрагента</name>
  <enumValues>
    <name>ВыручкаБезНДС</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаСНДС</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_ВидыОплатУслугКонтрагентов/абс_ВидыОплатУслугКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОплатУслугКонтрагентов</name>
  <enumValues>
    <name>Безналичная</name>
  </enumValues>
  <enumValues>
    <name>Наличная</name>
  </enumValues>
  <enumValues>
    <name>БесплатнаяОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ПредоставлениеСкидки</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
</mdclass:Enum>

Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>Расчетная ставка НДС 18% / 118%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>Расчетная ставка НДС 10% / 110%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>Расчетная ставка НДС 20% / 120%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Ставка НДС 5%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5_105</name>
    <comment>Расчетная ставка НДС 5/105</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Ставка НДС 7%</comment>
  </enumValues>
  <enumValues>
    <name>НДС7_107</name>
    <comment>Расчетная ставка НДС 7/107</comment>
  </enumValues>
</mdclass:Enum>

DataProcessors/Лео_ЗагрузкаДоговорыТчУслугиРетро/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ФильтрРасширенияФайлов = "" Тогда
		Объект.ФильтрРасширенияФайлов = "Документ Exel (*.xls)|*.xls|Документ Exel 2007(*.xlsx)|*.xlsx";
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Документ Exel(*.xls)|*.xls|Документ Exel 2007(*.xmlx)|*.xlsx";//Объект.ФильтрРасширенияФайлов;
	Если Диалог.Выбрать() Тогда
		Объект.ИмяФайла = Диалог.ПолноеИмяФайла; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФайлОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьУслугиРетро(Команда)
	Ф=Новый Файл(СокрЛП(Объект.ИмяФайла));
	Если Ф.Существует()=0 Тогда
		Сообщить("Указанный файл не существует!");
		Возврат;
	КонецЕсли;
	ВыбФайл = Новый Файл(Объект.ИмяФайла);
	Если ВыбФайл.Существует() Тогда
		Объект.РасширениеФайла = ВыбФайл.Расширение;
		Объект.ID = ВыбФайл.ИмяБезРасширения;
	КонецЕсли;
	
	ДвоичныйФайл = ПоместитьВоВременноеХранилище ( Новый ДвоичныеДанные(Объект.ИмяФайла),ЭтаФорма.УникальныйИдентификатор); 
	ПолучитьФайлНаСервере(ДвоичныйФайл);

КонецПроцедуры


&НаСервере
Процедура ПолучитьФайлНаСервере(ДвоичныйФайл);
	
	ДанныеДокумента = ПолучитьИзВременногоХранилища(ДвоичныйФайл);
	ИмяФайлаДляЗагрузки = КаталогВременныхФайлов()+"temp" + Объект.ID + Объект.РасширениеФайла;
	ДанныеДокумента.Записать(ИмяФайлаДляЗагрузки);

	
	ФайлEXCEL = ИмяФайлаДляЗагрузки ;
	ИмяЛиста = "Лист1";
	КолвоСтрокExcel = 1;
	СписокЗагрузки = ЗагрузитьМетодом_MSADODB(ФайлEXCEL,ИмяЛиста,1,,, КолвоСтрокExcel,"MicrosoftACEOLEDB12");
	
	ТаблицаДляЗагрузки = Новый ТаблицаЗначений;
	
	ТаблицаДляЗагрузки.Колонки.Добавить("НомерСтроки");                   //К_1	
	ТаблицаДляЗагрузки.Колонки.Добавить("Контрагент");                    //К_2
	ТаблицаДляЗагрузки.Колонки.Добавить("КодКонтрагента");           	  //К_3
	ТаблицаДляЗагрузки.Колонки.Добавить("Договор");           			  //К_4
	ТаблицаДляЗагрузки.Колонки.Добавить("КодДоговора");                   //К_5
	ТаблицаДляЗагрузки.Колонки.Добавить("абс_ПериодДействия", Новый ОписаниеТипов("Дата"));//К_6
	ТаблицаДляЗагрузки.Колонки.Добавить("абс_СтатьяОборотовПоБюджетам");  //К_7
	ТаблицаДляЗагрузки.Колонки.Добавить("КодСтатьи");                     //К_8
	ТаблицаДляЗагрузки.Колонки.Добавить("абс_ЦФО");                       //К_9
	ТаблицаДляЗагрузки.Колонки.Добавить("абс_АналитикаСтатьиПоБюджету");  //К_10
	ТаблицаДляЗагрузки.Колонки.Добавить("КодАналитикаСтатьиПоБюджету");   //К_11
	ТаблицаДляЗагрузки.Колонки.Добавить("абс_ПериодичностьНачисления");   //К_12
	ТаблицаДляЗагрузки.Колонки.Добавить("абс_БазаНачисления");        	  //К_13
	ТаблицаДляЗагрузки.Колонки.Добавить("абс_ВидОплаты");                 //К_14
	ТаблицаДляЗагрузки.Колонки.Добавить("абс_ОплатаФиксированнойСуммой"); //К_15
	ТаблицаДляЗагрузки.Колонки.Добавить("Лео_ПороговаяСумма");            //К_16
	ТаблицаДляЗагрузки.Колонки.Добавить("абс_Процент");   				  //К_17
	ТаблицаДляЗагрузки.Колонки.Добавить("абс_Сумма");             		  //К_18
	ТаблицаДляЗагрузки.Колонки.Добавить("абс_ДоговорУслугРетро");         //К_19
	ТаблицаДляЗагрузки.Колонки.Добавить("Лео_ДопСоглашение");             //К_20
	ТаблицаДляЗагрузки.Колонки.Добавить("Лео_Комментарий");               //К_21
			
	Для каждого Строка из СписокЗагрузки Цикл
			
			ТекСтр = ТаблицаДляЗагрузки.Добавить();
			ТекСтр.НомерСтроки                      = Строка.К_1;
            ТекСтр.Контрагент                       = Строка.К_2;
			ТекСтр.КодКонтрагента                	= Строка.К_3;
			ТекСтр.Договор                     		= Строка.К_4;
			ТекСтр.КодДоговора                      = Строка.К_5;
			ТекСтр.абс_ПериодДействия               = Дата(Строка.К_6+" 00:00:00");
			ТекСтр.абс_СтатьяОборотовПоБюджетам     = Строка.К_7;
			ТекСтр.КодСтатьи                        = Строка.К_8;
			ТекСтр.абс_ЦФО                 			= Строка.К_9;
			ТекСтр.абс_АналитикаСтатьиПоБюджету     = Строка.К_10;
			ТекСтр.КодАналитикаСтатьиПоБюджету      = Строка.К_11;
			ТекСтр.абс_ПериодичностьНачисления      = Строка.К_12;
			ТекСтр.абс_БазаНачисления               = Строка.К_13;
			ТекСтр.абс_ВидОплаты                    = Строка.К_14;
			ТекСтр.абс_ОплатаФиксированнойСуммой    = Строка.К_15;               
			ТекСтр.Лео_ПороговаяСумма               = Строка.К_16;
			ТекСтр.абс_Процент             			= Строка.К_17;
			ТекСтр.абс_Сумма                        = Строка.К_18;
			ТекСтр.абс_ДоговорУслугРетро            = Строка.К_19;
			ТекСтр.Лео_ДопСоглашение                = Строка.К_20;
			ТекСтр.Лео_Комментарий                  = Строка.К_21;
		
	КонецЦикла;	
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Подготовка и загрузка таблицы/////////////////////////////////////////////////////////////////////////////////////////////////////
	Для каждого Строка из ТаблицаДляЗагрузки Цикл		
		//+Контрагент
		Если НЕ Строка.КодКонтрагента = Неопределено Тогда
			Контрагент = Справочники.Контрагенты.НайтиПоКоду(Строка.КодКонтрагента);	
		Иначе
			Если НЕ Строка.Контрагент = Неопределено Тогда
				Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(Строка.Контрагент);
			Иначе
				Сообщить ( "Строка " +  Строка.НомерСтроки + " не найден контрагент по номеру и ноименованию. Контрагент = "  + Строка.Контрагента + " Загрузка не возможна");
				Возврат	
			КонецЕсли;
		КонецЕсли;
		//-Контрагент
		
		//+Договор
		Если НЕ Строка.КодДоговора = Неопределено Тогда
			Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду(Строка.КодДоговора,,,Контрагент);	
		Иначе
			Если НЕ Строка.Договор = Неопределено Тогда
				Договор = Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию(Строка.Догоаор,,,Контрагент);
			Иначе
				Договор = Контрагент.ОсновнойДоговорКонтрагента;
				Если  Договор = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку() Тогда
					Сообщить ( "Строка " +  Строка.НомерСтроки + " не найден договор по номеру и ноименованию. Контрагент = "  + Строка.Контрагента + " Загрузка не возможна");
					Возврат	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//-Договор

		ОбъектДоговор = Договор.ПолучитьОбъект();
		СтрокаУслугиРетро = ОбъектДоговор.абс_УслугиРетро.Добавить();
		СтрокаУслугиРетро.абс_ПериодДействия = Строка.абс_ПериодДействия;
		
		Если Строка.абс_ПериодичностьНачисления = "Квартал"  Тогда
			СтрокаУслугиРетро.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.Квартал;
		ИначеЕсли  Строка.абс_ПериодичностьНачисления = "Год"  Тогда
			СтрокаУслугиРетро.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.Год;
		ИначеЕсли  Строка.абс_ПериодичностьНачисления = "Месяц"  Тогда
			СтрокаУслугиРетро.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.Месяц;	
		ИначеЕсли  Строка.абс_ПериодичностьНачисления = "Разовое начисление"  Тогда
			СтрокаУслугиРетро.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.РазовоеНачисление;	
		КонецЕсли;	
		
		Если Строка.абс_БазаНачисления = "Выручка с НДС"  Тогда
			СтрокаУслугиРетро.абс_БазаНачисления = Перечисления.абс_БазаНачисленияУслугКонтрагента.ВыручкаСНДС;
		ИначеЕсли  Строка.абс_БазаНачисления = "Выручка без НДС"  Тогда
			СтрокаУслугиРетро.абс_БазаНачисления = Перечисления.абс_БазаНачисленияУслугКонтрагента.ВыручкаБезНДС;	
		КонецЕсли;
		
		Если Строка.абс_ВидОплаты = "Взаимозачет"  Тогда
			СтрокаУслугиРетро.абс_ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.Взаимозачет;
		ИначеЕсли  Строка.абс_ВидОплаты = "Безналичная"  Тогда
			СтрокаУслугиРетро.абс_ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.Безналичная;
		ИначеЕсли  Строка.абс_ВидОплаты = "Наличная"  Тогда
			СтрокаУслугиРетро.абс_ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.Наличная;	
		ИначеЕсли  Строка.абс_ВидОплаты = "Предоставление скидки"  Тогда
			СтрокаУслугиРетро.абс_ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.ПредоставлениеСкидки;
		ИначеЕсли  Строка.абс_ВидОплаты = "Бесплатная отгрузка"  Тогда
			СтрокаУслугиРетро.абс_ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.БесплатнаяОтгрузка;	
		КонецЕсли;
		
		Если Строка.абс_ОплатаФиксированнойСуммой = "Да"  Тогда
            СтрокаУслугиРетро.абс_ОплатаФиксированнойСуммой = Истина;
		Иначе
			СтрокаУслугиРетро.абс_ОплатаФиксированнойСуммой = Ложь;
		КонецЕсли;

		СтрокаУслугиРетро.абс_Процент = Строка.абс_Процент;
        СтрокаУслугиРетро.абс_Сумма = Строка.абс_Сумма;
		СтрокаУслугиРетро.абс_СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоКоду(Строка.КодСтатьи);
		СтрокаУслугиРетро.абс_АналитикаСтатьиПоБюджету = Справочники.абс_АналитикиБюджета.НайтиПоКоду(Строка.КодАналитикаСтатьиПоБюджету);
		СтрокаУслугиРетро.абс_ЦФО = Справочники.Подразделения.НайтиПоНаименованию( Строка.абс_ЦФО);
        СтрокаУслугиРетро.Лео_ДопСоглашение = Строка.Лео_ДопСоглашение;
        СтрокаУслугиРетро.Лео_Комментарий = Строка.Лео_Комментарий;
		СтрокаУслугиРетро.Лео_ПороговаяСумма = Строка.Лео_ПороговаяСумма;
		
		Попытка
			ОбъектДоговор.Записать();
		    Сообщить("Внесены данные в договор " + ОбъектДоговор);
		Исключение
			Сообщить("Не удалось записать договор " + ОбъектДоговор);
			Инфо = ИнформацияОбОшибке();
		КонецПопытки;
	КонецЦикла;		
КонецПроцедуры


&НаСервере
Функция СтавкаНДС(Ставка)
	
	Если Ставка = "18" Тогда 
		СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
		Возврат СтавкаНДС;
	ИначеЕсли Ставка = "20" Тогда 
		СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
		Возврат СтавкаНДС;
	ИначеЕсли Ставка = "10" Тогда 
		СтавкаНДС = Перечисления.СтавкиНДС.НДС10;
		Возврат СтавкаНДС; 
	ИначеЕсли Ставка = "5" Тогда 
		СтавкаНДС = Перечисления.СтавкиНДС.НДС5;
		Возврат СтавкаНДС;
	ИначеЕсли Ставка = "7" Тогда 
		СтавкаНДС = Перечисления.СтавкиНДС.НДС7;
		Возврат СтавкаНДС;
	КонецЕсли;
	
	Возврат 0;

КонецФункции

&НаСервере
Функция ЗагрузитьМетодом_MSADODB(Знач ФайлEXCEL, Знач ИмяЛиста, Знач СтрокаЗаголовка = 3, НачСтрока = 0, КонСтрока = 0, КолвоСтрокExcel, 
	Знач ПодключениеADODB = "MicrosoftJetOLEDB40") Экспорт
	Перем СonnectionString, ADODBConnection, ADODBRecordset, ТекстЗапроса;
	Перем КолвоКолонокExcel, Поле, Колонка, ИмяКолонки;
	Перем НоваяСтрока, НомерСтроки;
	Перем ТаблицаРезультат;
	
	// Нумерация MS ADODB начинается с 1.
	
	// Переменная "СтрокаЗаголовка", не используется, т.к. HDR=YES, а не HDR=NO.
	// HDR=YES:
	// 1. Считывание заголовков колонок с 1-ой строки.
	// 2. Считываемые данные со 2-ой и последующих строк типизированы. Для варианта HDR=NO: считываемые данные - строка.
	
	// Строка соединения - определение драйвера, который будет использован для подключения к файлу EXCEL.
	Если ПодключениеADODB = "MicrosoftACEOLEDB12" Тогда
		
		// ACE.OLEDB.12.0 - Для использования данного подключения необходимо дополнительное ПО:
		// Microsoft Access Database Engine 2010 Redistributable 32/64 bit.
		//Для корректной работы также установил:
		//http://www.microsoft.com/en-us/download/details.aspx?id=13255
		//http://www.microsoft.com/en-us/download/details.aspx?id=23734		
		
		СonnectionString = "Provider=Microsoft.ACE.OLEDB.12.0;Data Source= " + СокрЛП(ФайлEXCEL) + ";Extended Properties=""Excel 12.0;HDR=NO;IMEX=1;""";
		
		// Еще один вариант.
		//СтрокаСоединения = "Driver={Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)};Dbq=" + СокрЛП(ФайлEXCEL) + ";";
		
	Иначе
		
		// Jet.OLEDB.4.0 - Стандартное подключение, как правило, не требующее установки дополнительного ПО. 
		// Рекомендуется установить последний Service Pack Windows.
		СonnectionString = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source= "  + СокрЛП(ФайлEXCEL) + ";Extended Properties=""Excel 8.0;HDR=NO;IMEX=1;""";
		
		// Еще один вариант.
		//СтрокаСоединения = "Driver={Microsoft Excel Driver (*.xls)};Dbq=" + СокрЛП(ФайлEXCEL) + ";";
		
	КонецЕсли;
	
	Попытка
		// Инициализация основного объекта ADODB.Connection. Открытие соединения.
		ADODBConnection = Новый COMОбъект("ADODB.Connection");
		ADODBConnection.ConnectionString =  СonnectionString;
		ADODBConnection.Open();
		// Импирически определенный параметр для правильного определения количества строк листа.
		ADODBConnection.CursorLocation = 3;    // По-умолчанию 2.
	Исключение
		Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецПопытки;
	
	ТекстЗапроса = "SELECT * FROM [" + ИмяЛиста + "$]";
	
	// Создание Recordset. Дочерний объект ADODBConnection. Набор записей по запросу.
	Попытка
		ADODBRecordset = Новый COMОбъект("ADODB.Recordset");
		ADODBRecordset.Open(ТекстЗапроса, ADODBConnection);
		
		// Проверка заполненности листа.
		Если (ADODBRecordset.EOF ИЛИ ADODBRecordset.BOF) Тогда
			КолвоСтрокExcel = 0;
			Сообщить(НСтр("ru = '" + ИмяЛиста + ": не содержит данных.'"), СтатусСообщения.Внимание);
			
			// Завершение работы.
			// Закрытие Объектов.
			ADODBRecordset.Close();
			ADODBConnection.Close();
			ADODBRecordset   = Неопределено;
			ADODBConnection = Неопределено;
			
			Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
		КонецЕсли;
		
		// Импирически определенные параметры для правильного определения количества строк листа.
		ADODBRecordset.AbsolutePage     = 1;
		ADODBRecordset.AbsolutePosition = 1;
	Исключение
		Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецПопытки;
	
	// Параметр, возвращаемый в вызывающую процедуру.
	КолвоСтрокExcel = ADODBRecordset.RecordCount + 1;    // (+1) - учет Строки-Заголовока, которая "съедается".
	КолвоКолонокExcel = ADODBRecordset.Fields.Count;
	
	// Проверка заполненности листа.
	Если КолвоСтрокExcel <= 2 Тогда
		КолвоСтрокExcel = 0;
		Сообщить(НСтр("ru = '" + ИмяЛиста + ": не содержит данных.'"), СтатусСообщения.Внимание);
		
		// Завершение работы.
		// Закрытие Объектов.
		ADODBRecordset.Close();
		ADODBConnection.Close();
		ADODBRecordset   = Неопределено;
		ADODBConnection = Неопределено;
		
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецЕсли;
	
	// Создание результирующей таблицы, в которую будут записываться считанные из EXCEL данные.
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	// Формирование колонок результирующей таблицы.
	
	// "НомерСтроки" - для наглядности и удобства.
	// В зависимости от разрабатываемой обработки.
	// "Сопоставлено" - может быть другим.
	// Здесь же могут быть добавлены другие колонки, не формируемые из содержимого файла EXCEL.
	
	//ТаблицаРезультат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"), "№", 4);
	//ТаблицаРезультат.Колонки.Добавить("Сопоставлено", Новый ОписаниеТипов("Булево"), "Сопоставлено", 1);
	
	Для ит = 1 ПО КолвоКолонокExcel Цикл
		
		Поле = ADODBRecordset.Fields.Item(ит - 1);
		ИмяКолонки = "К_" + ит;
		//ИмяКолонки = Поле.Value;
		//Колонка = ТаблицаРезультат.Колонки.Добавить(ИмяКолонки, , СокрЛП(СтрЗаменить(Поле.Name, "#", ".")));
		ИмяКолонки = ЗаменитьСимволы(ИмяКолонки);
		Колонка = ТаблицаРезультат.Колонки.Добавить(ИмяКолонки, ,ИмяКолонки);
		
		// Замена "#" на ".", т.к. при считывании ADODB "." в имени колонки заменяется на "#".
	КонецЦикла;
	
	// ТаблицаРезультат: 1-я строка - Строка-Заголовок.
	
	// Добавление этой строки обусловлено исключительно из соображений идентичности содержимого файла EXCEL и ТаблицыЗначений,
	// выводимой на форме Обработки, и дальнейшей обработки строки заголовка
	// с целью сопоставления колонок EXCEL и реквизитов 1С: для Справочников, ПВХ, Регистров, Документов.
	
	// Если в Вашей обработке в результирующей таблице в качестве 1-ой строки не нужна Строка-Заголовок, то
	// следует закомментировать следующий цикл:
	//НоваяСтрока = ТаблицаРезультат.Добавить();
	//НоваяСтрока.НомерСтроки = 1;
	//Для ит = 1 ПО КолвоКолонокExcel Цикл
	//	
	//	ИмяКолонки = "К_" + ит;
	//	Колонка = ТаблицаРезультат.Колонки.Найти(ИмяКолонки);
	//	НоваяСтрока[ИмяКолонки] = Колонка.Заголовок;
	//	
	//КонецЦикла;
	
	// ТаблицаРезультат: Формирование строк по указанному диапазону: НачСтрока - КонСтрока.
	
	НомерСтроки = 1;
	НачСтрока =  СтрокаЗаголовка+1;
	Пока ADODBRecordset.EOF() = 0 Цикл
		
		//НомерСтроки = НомерСтроки + 1;
		
		Если НомерСтроки < НачСтрока Тогда    // Номер строки вне диапазона считываемых строк.
			ADODBRecordset.MoveNext();             // Следующая строка.
			//Продолжить;
			НомерСтроки = НомерСтроки + 1;
			Продолжить;
		КонецЕсли;
		
		Если КонСтрока > 0 И НомерСтроки > КонСтрока Тогда    // Номер строки вне диапазона считываемых строк.
			Прервать;
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		//НоваяСтрока.НомерСтроки = НомерСтроки;
		
		Для ит = 1 ПО КолвоКолонокExcel Цикл
			
			Поле = ADODBRecordset.Fields.Item(ит - 1);
			
			Если Поле.ActualSize = 0 Тогда        // Пустое поле EXCEL.
				Продолжить;
			КонецЕсли;
			
			ЗначениеЯчейки = Поле.Value;        // Учитывая параметр HDR=YES в строке соединения, данные считываются в соответствии с их типом.
			
			ИмяКолонки = ит-1;
			НоваяСтрока[ИмяКолонки] = ЗначениеЯчейки;
			
			// Используется при формировании таблицы на форме обработки.
			//ШиринаКолонки = ТаблицаРезультат.Колонки[ИмяКолонки].Ширина;
			//ДлинаСтроки      = СтрДлина(СокрЛП(ЗначениеЯчейки));
			//ТаблицаРезультат.Колонки[ИмяКолонки].Ширина = ?(ШиринаКолонки < ДлинаСтроки, ДлинаСтроки, ШиринаКолонки);
			
		КонецЦикла;
		
		ADODBRecordset.MoveNext();   // Следующая строка.
		
	КонецЦикла;
	
	//УдалитьКолонкиСНулевойШириной(ТаблицаРезультат);
	
	// Завершение работы.
	// Закрытие Объектов.
	ADODBRecordset.Close();
	ADODBConnection.Close();
	ADODBRecordset   = Неопределено;
	ADODBConnection = Неопределено;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

&НаСервере
Функция ЗаменитьСимволы(Стр)
	Стр = СтрЗаменить(Стр, " ", "");
	Стр = СтрЗаменить(Стр, "-", "");
	Стр = СтрЗаменить(Стр, "/", "");
	Стр = СтрЗаменить(Стр, ":", "");
	Стр = СтрЗаменить(Стр, ".", "");
	Стр = СтрЗаменить(Стр, "№", "");
	Стр = СтрЗаменить(Стр, "(", "");
	Стр = СтрЗаменить(Стр, ")", "");
	Возврат Стр;
КонецФункции
